{
  "header": {
    "home": "Home",
    "about": "Sobre",
    "education": "Formação",
    "professional": "Profissional"
  },
  "home": {
    "role": "Software Full Stack Developer",
    "description": "Estudante de Ciência da Computação, apaixonado por tecnologia, automação e inteligência artificial."
  },
  "about": {
    "dev_title": "Desenvolvedor de Software Full Stack",
    "dev_p1": "Atualmente, atuo como Desenvolvedor de Software Full Stack, trabalhando no desenvolvimento de soluções digitais completas, desde a interface até a lógica de negócio e integração com sistemas. No meu dia a dia, lido com desafios reais de produto, arquitetura, organização de código e construção de funcionalidades escaláveis e bem estruturadas.",
    "dev_p2": "Tenho foco em qualidade, performance e boas práticas de desenvolvimento, buscando sempre criar soluções eficientes, organizadas e sustentáveis a longo prazo. Essa experiência tem fortalecido minha visão sistêmica, minha capacidade de resolver problemas complexos e minha maturidade profissional dentro da área de tecnologia.",
    "first_job_title": "Primeira experiência profissional",
    "first_job_p1": "Minha primeira experiência profissional como vendedor foi um divisor de águas no meu desenvolvimento pessoal. Foi nesse ambiente que aprendi a lidar com pessoas, pressão por resultados e desafios reais do mercado de trabalho. No início, enfrentei dificuldades, mas foi exatamente isso que me fez evoluir, desenvolver maturidade emocional e construir uma postura mais profissional.",
    "first_job_p2": "Esse período me proporcionou habilidades fundamentais como comunicação estratégica, escuta ativa, negociação, inteligência emocional e organização. Aprendi a entender necessidades, apresentar soluções de forma clara e trabalhar com metas, prazos e responsabilidade — competências que hoje aplico diretamente na área de tecnologia e desenvolvimento de software.",
    "portugal_title": "Período em Portugal",
    "portugal_p1": "Minha experiência em Portugal representou um grande salto no meu crescimento pessoal e mental. Viver fora do país, longe da família e da zona de conforto, me forçou a amadurecer rapidamente e desenvolver autonomia, responsabilidade e independência. Aprendi a lidar com novos desafios, culturas diferentes e realidades totalmente fora do que eu estava acostumado.",
    "portugal_p2": "Esse período fortaleceu minha capacidade de adaptação, resiliência e autogestão. Enfrentar dificuldades sozinho me ensinou a confiar mais em mim mesmo, a tomar decisões com mais consciência e a construir uma mentalidade mais forte, estratégica e focada em evolução contínua.",
    "football_title": "Futebol",
    "football_p1": "O futebol sempre foi uma base importante na formação do meu caráter e da minha mentalidade. Muito além do esporte, ele me ensinou valores que levo diretamente para minha vida profissional, como disciplina, comprometimento, foco e trabalho em equipe. Dentro de campo, aprendi a lidar com pressão, tomar decisões rápidas e manter a clareza mesmo em situações adversas — habilidades essenciais no mundo profissional.",
    "football_p2": "A rotina de treinos, a busca constante por evolução e a competitividade saudável moldaram minha mentalidade de crescimento. Isso me ensinou a não me acomodar, a buscar sempre melhorar e a entender que consistência e esforço diário são fatores decisivos para alcançar resultados sólidos, tanto no esporte quanto na carreira."
  },
  "education": {
    "title": "FORMAÇÃO",
    "feup_name": "FEUP — Faculdade de Engenharia da Universidade do Porto",
    "feup_desc": "Porto, Portugal — Licenciatura em Engenharia Eletrotécnica e de Computadores (interrompido)",
    "fiap_name": "FIAP — Faculdade de Informática e Administração Paulista",
    "fiap_desc": "São Paulo, SP — Bacharelado em Ciências da Computação (cursando)",
    "alura_name": "ALURA — Plataforma Online",
    "alura_desc": "Cursos de Programação (06/2023 – 06/2025)"
  },
  "professional": {
    "title": "EXPERIÊNCIA PROFISSIONAL",
    "kruzer_junior_role": "KRUZER, São Paulo — Desenvolvedor Júnior",
    "kruzer_junior_period": "12/2025 – atualmente",
    "kruzer_junior_li1": "Atuação em ambiente de desenvolvimento com foco em desenvolvimento de software",
    "kruzer_junior_li2": "Desenvolvimento de habilidades em",
    "kruzer_junior_li2_tech": "JavaScript, TypeScript e React",
    "kruzer_intern_role": "KRUZER, São Paulo — Estágio em Desenvolvimento",
    "kruzer_intern_period": "05/2025 – 12/2025",
    "kruzer_intern_li1": "Atuação em ambiente de desenvolvimento com foco em suporte técnico e desenvolvimento de software",
    "kruzer_intern_li2": "Desenvolvimento de habilidades em",
    "kruzer_intern_li2_tech": "JavaScript, TypeScript e React",
    "javendeu_role": "JA VENDEU, São Paulo — Vendedor Pleno",
    "javendeu_period": "12/2022 – 06/2024",
    "javendeu_li1": "Evolução rápida na empresa com duas promoções",
    "javendeu_li2": "Desenvolvimento de competências em",
    "javendeu_li2_skills": "comunicação, resolução de problemas e trabalho em equipe"
  },
  "footer": {
    "contact": "demattosmartins@gmail.com"
  }
}
